cloudbsdorg/freebsd-src-oci/usr.sbin/ocifbsd/ocifbsd.8
.\" Copyright (c) 2024 The FreeBSD Foundation
.\" Copyright (c) 2026 REVYTECH, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF
.\" THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\"
.\" $FreeBSD$
.Dd July 22, 2026
.Dt OCIFBSD 8
.Os
.Sh NAME
.Nm ocifbsd
.Nd FreeBSD native OCI runtime
.Sh SYNOPSIS
.Nm
.Op Fl vhV
.Ar command
.Op Ar arguments
.Sh DESCRIPTION
.Nm
is a FreeBSD-native OCI (Open Container Initiative) runtime.
It maps OCI bundles to
.Xr jail 8
parameters, manages container lifecycle state under
.Pa /var/run/ocifbsd ,
and applies host-side mounts (nullfs, devfs, procfs, tmpfs, fdescfs)
into the container rootfs on start.
.Pp
The following commands are available:
.Bl -tag -width indent
.It Cm create Oo Fl n Ar name Oc Ar bundle
Create a container from an OCI bundle.
The jail is created with
.Cm persist
so it remains until
.Cm start
or
.Cm delete .
Prints the 64-hex container id on stdout.
If the bundle or image configuration does not specify a hostname, the
container's hostname defaults to its name (or, absent a name, its id) so
.Xr sysctl 8
.Va kern.hostname
inside the jail is never empty.
.It Cm start Ar container-id
Start a created container (attach init process, apply mounts).
.It Cm kill Ar container-id Op Fl s Ar signal
Send a signal to the container init process.
Default is SIGTERM.
Idempotent for already-stopped or never-started containers.
.It Cm delete Ar container-id Op Fl f
Delete a container and unmount applied mounts.
Use
.Fl f
to force deletion of a running container.
.It Cm state Ar container-id
Show the current state of a container.
The reported state is reconciled against the live jail: a container
recorded as
.Cm running
or
.Cm paused
whose jail no longer exists (for example after a host reboot or an
external
.Xr jail 8
removal) is reported as
.Cm stopped .
.It Cm list
List known containers from the state directory.
As with
.Cm state ,
each container's status reflects actual jail liveness rather than only
the last value written to the state file.
.It Cm inspect Ar container-id
Show detailed container metadata as JSON.
.It Cm run Oo Fl n Ar name Oc Ar bundle
Create and start a container in one command.
.It Cm pull Oo Fl n | -dry-run Oc Ar reference
Parse an OCI image reference and print registry, repository, tag, and
store path (default
.Pa /var/lib/ocifbsd ,
overridable with
.Ev OCIFBSD_DATA_DIR ) .
With
.Fl n
only resolve and print.
Without
.Fl n ,
fetch the manifest and layers via the OCI Distribution API into that path.
.It Cm load Oo Fl n Ar reference Oc Ar archive
Import a local OCI image into the image store.
.Ar archive
may be a directory in OCI image-layout form
.Pq Pa oci-layout , index.json , blobs/
or a
.Pa .tar , .tar.gz ,
or
.Pa .tar.xz
archive of that layout, such as the container images published at
.Pa https://download.freebsd.org/releases/OCI-IMAGES/ .
The image layers are verified against their manifest digests and unpacked
into a rootfs, and a runtime
.Pa config.json
is generated from the image configuration, so the result can be run with
.Cm create Fl Fl image
or
.Cm run Fl Fl image .
With
.Fl n
the store entry is named by the given reference instead of the archive's
.Li org.opencontainers.image.ref.name
annotation.
.It Cm images
List top-level entries under the local image store
.Pq Pa /var/lib/ocifbsd .
An empty or missing store is not an error.
.El
.Sh OPTIONS
Global options (before the command):
.Bl -tag -width ".Fl v"
.It Fl v , -verbose
Enable verbose output.
.It Fl h , -help
Show help message and exit.
.It Fl V , -version
Show version information and exit.
.El
.Pp
Subcommand options:
.Bl -tag -width indent
.It Fl n Ar name , -name Ar name
Human-readable name for
.Cm create
and
.Cm run
(also used in jail naming).
.It Fl s Ar signal , -signal Ar signal
Signal for
.Cm kill
(number or name).
.It Fl f , -force
Force
.Cm delete
of a running container.
.El
.Sh EXAMPLES
Create a container from an OCI bundle:
.Bd -literal
ocifbsd create --name my-container /path/to/bundle
.Ed
.Pp
Start, inspect state, signal, and delete:
.Bd -literal
ocifbsd start <id>
ocifbsd state <id>
ocifbsd kill <id>
ocifbsd delete --force <id>
.Ed
.Pp
Create and run in one command:
.Bd -literal
ocifbsd run --name web /path/to/bundle
.Ed
.Sh FILES
.Bl -tag -width ".Pa /var/run/ocifbsd" -compact
.It Pa /var/run/ocifbsd/
Runtime state directory (per-container JSON)
.It Pa /var/lib/ocifbsd/
Image and volume data directory (future image store)
.It Pa /etc/ocifbsd/
Configuration directory (reserved)
.El
.Sh SEE ALSO
.Xr jail 8 ,
.Xr jail 3 ,
.Xr mount 8 ,
.Xr rctl 8
.Sh HISTORY
.Nm
was developed to provide native OCI runtime support for FreeBSD.
Phase 1 acceptance covers create/start/state/kill/delete with ATF
unit and root integration tests on FreeBSD lab hosts.
.Sh AUTHORS
.Nm
was developed by Klara, Inc. under sponsorship from the FreeBSD Foundation,
with REVYTECH, Inc. lifecycle and test work on
.Li feature/oci-bootstrap .
