cloudbsdorg/freebsd-src-oci/usr.sbin/ocifbsd/ocifbsd.8
.\" Copyright (c) 2026 REVYTECH, Inc.
.\" Copyright (c) 2026 REVYTECH, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF
.\" THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\"
.\" $FreeBSD$
.Dd July 22, 2026
.Dt OCIFBSD 8
.Os
.Sh NAME
.Nm ocifbsd
.Nd FreeBSD native OCI runtime
.Sh SYNOPSIS
.Nm
.Op Fl vhV
.Ar command
.Op Ar arguments
.Sh DESCRIPTION
.Nm
is a FreeBSD-native OCI (Open Container Initiative) runtime.
It maps OCI bundles to
.Xr jail 8
parameters, manages container lifecycle state under
.Pa /var/run/ocifbsd ,
and applies host-side mounts (nullfs, devfs, procfs, tmpfs, fdescfs)
into the container rootfs on start.
.Pp
The following commands are available:
.Bl -tag -width indent
.It Cm create Oo Fl n Ar name Oc Ar bundle
Create a container from an OCI bundle.
The jail is created with
.Cm persist
so it remains until
.Cm start
or
.Cm delete .
Prints the 64-hex container id on stdout.
If the bundle or image configuration does not specify a hostname, the
container's hostname defaults to its name (or, absent a name, its id) so
.Xr sysctl 8
.Va kern.hostname
inside the jail is never empty.
.It Cm start Ar container-id
Start a created container (attach init process, apply mounts).
.It Cm kill Ar container-id Op Fl s Ar signal
Send a signal to the container init process.
Default is SIGTERM.
Idempotent for already-stopped or never-started containers.
.It Cm delete Ar container-id Op Fl f
Delete a container and unmount applied mounts.
Use
.Fl f
to force deletion of a running container.
.It Cm state Ar container-id
Show the current state of a container.
The reported state is reconciled against the live jail: a container
recorded as
.Cm running
or
.Cm paused
whose jail no longer exists (for example after a host reboot or an
external
.Xr jail 8
removal) is reported as
.Cm stopped .
.It Cm list
List known containers from the state directory.
As with
.Cm state ,
each container's status reflects actual jail liveness rather than only
the last value written to the state file.
.It Cm inspect Ar container-id
Show detailed container metadata as JSON.
.It Cm run Oo Fl n Ar name Oc Ar bundle
Create and start a container in one command.
.It Cm pull Oo Fl n | -dry-run Oc Ar reference
Parse an OCI image reference and print registry, repository, tag, and
store path (default
.Pa /var/lib/ocifbsd ,
overridable with
.Ev OCIFBSD_DATA_DIR ) .
With
.Fl n
only resolve and print.
Without
.Fl n ,
fetch the manifest and layers via the OCI Distribution API into that path.
.It Cm load Oo Fl n Ar reference Oc Ar archive
Import a local OCI image into the image store.
.Ar archive
may be a directory in OCI image-layout form
.Pq Pa oci-layout , index.json , blobs/
or a
.Pa .tar , .tar.gz ,
or
.Pa .tar.xz
archive of that layout, such as the container images published at
.Pa https://download.freebsd.org/releases/OCI-IMAGES/ .
The image layers are verified against their manifest digests and unpacked
into a rootfs, and a runtime
.Pa config.json
is generated from the image configuration, so the result can be run with
.Cm create Fl Fl image
or
.Cm run Fl Fl image .
With
.Fl n
the store entry is named by the given reference instead of the archive's
.Li org.opencontainers.image.ref.name
annotation.
.It Cm images
List top-level entries under the local image store
.Pq Pa /var/lib/ocifbsd .
An empty or missing store is not an error.
.It Cm rmi Oo Fl f Oc Ar reference
Remove the local image store for
.Ar reference .
By default this is refused if a container was created from that image
.Pq its bundle still points at the store ,
so that removing the image cannot delete a running container's root
filesystem; the error names the container.
.Fl f
.Pq Fl Fl force
removes the image anyway.
.It Cm network Cm list Op Ar container
Show the network configuration (VNET, IPv4/IPv6 addresses, gateways, and
DNS servers) of one container, or of every container when no argument is
given.
Requires view privilege
.Pq root or the Sy ocifbsd No group .
.It Cm network Cm set Ar container Oo options Oc
Modify a container's persisted network configuration.
Options accumulate onto the existing configuration:
.Bl -tag -width ".Fl Fl gateway4 Ar addr" -compact
.It Fl Fl vnet Ar on Ns | Ns Ar off
Enable or disable VNET (network stack isolation).
.It Fl Fl ip4 Ar cidr , Fl Fl ip6 Ar cidr
Add an IPv4 or IPv6 address in CIDR form
.Pq Ar addr Ns / Ns Ar prefix ;
may be repeated.
.It Fl Fl gateway4 Ar addr , Fl Fl gateway6 Ar addr
Set the default IPv4 or IPv6 gateway.
.It Fl Fl dns Ar addr
Add a DNS nameserver; may be repeated.
.It Fl Fl clear , Fl Fl clear-ip4 , Fl Fl clear-ip6 , Fl Fl clear-dns
Remove all, or a specific class of, address/DNS entries.
.El
Every value is validated before being stored; an invalid address is
rejected and the configuration is left unchanged.
The configuration is written to
.Pa /var/lib/ocifbsd/networks/ Ns Ao Ar id Ac Ns Pa .json
with mode 0640, group-owned by the
.Sy ocifbsd
group.
Requires modify privilege
.Pq root or the Sy ocifbsd No group .
.El
.Sh SECURITY
Runtime state under
.Pa /var/run/ocifbsd
and generated
.Pa config.json
files are created mode 0750/0640 and group-owned by the
.Sy ocifbsd
administrative group when it exists, so that only root and members of
that group can view or modify container configuration.
When the group does not exist, access is restricted to root only.
The
.Cm network
subcommands additionally enforce this policy in-process: viewing requires
membership in that set, and modifying requires it as well.
.Sh OPTIONS
Global options (before the command):
.Bl -tag -width ".Fl v"
.It Fl v , -verbose
Enable verbose output.
.It Fl J , -pretty
Pretty-print JSON output with indentation for the commands that emit JSON
.Pq Cm inspect , state .
This is the default; the flag is accepted for explicitness.
.It Fl c , -compact
Print JSON as a single compact line instead of the pretty-printed default,
for scripts and pipelines.
.It Fl h , -help
Show help message and exit.
.It Fl V , -version
Show version information and exit.
.El
.Pp
Subcommand options:
.Bl -tag -width indent
.It Fl n Ar name , -name Ar name
Human-readable name for
.Cm create
and
.Cm run
(also used in jail naming).
.It Fl s Ar signal , -signal Ar signal
Signal for
.Cm kill
(number or name).
.It Fl f , -force
Force
.Cm delete
of a running container.
.El
.Sh ENVIRONMENT
.Bl -tag -width ".Ev OCIFBSD_REGISTRIES_CONF"
.It Ev OCIFBSD_DATA_DIR
Override the image and volume data directory
.Pq default Pa /var/lib/ocifbsd .
.It Ev OCIFBSD_STATE_DIR
Override the runtime state directory
.Pq default Pa /var/run/ocifbsd ,
useful for tests or an unprivileged, self-contained instance.
.It Ev OCIFBSD_REGISTRIES_CONF
Override the path to the registry alias table
.Pq see Sx FILES .
.El
.Sh FILES
.Bl -tag -width ".Pa /var/run/ocifbsd" -compact
.It Pa /var/run/ocifbsd/
Runtime state directory (per-container JSON)
.It Pa /var/lib/ocifbsd/
Image and volume data directory (future image store)
.It Pa /var/lib/ocifbsd/networks/
Per-container network configuration
.Pq Cm network set
.It Pa /etc/ocifbsd/
Configuration directory
.It Pa /usr/local/etc/ocifbsd/registries.conf , Pa /etc/ocifbsd/registries.conf
Registry alias table: maps a registry reference name to its API host and token
endpoint, selects the transport (TLS by default; plain HTTP for registries
marked insecure and for localhost), and sets the default registry for
unqualified image references via a
.Ic default-registry
directive
.Pq default Li docker.io .
Built-in defaults cover Docker Hub, so this file is optional.
See the shipped example for the format.
.El
.Sh EXAMPLES
Create a container from an OCI bundle:
.Bd -literal
ocifbsd create --name my-container /path/to/bundle
.Ed
.Pp
Start, inspect state, signal, and delete:
.Bd -literal
ocifbsd start <id>
ocifbsd state <id>
ocifbsd kill <id>
ocifbsd delete --force <id>
.Ed
.Pp
Create and run in one command:
.Bd -literal
ocifbsd run --name web /path/to/bundle
.Ed
.Sh SEE ALSO
.Xr jail 3 ,
.Xr ocifbsd.conf 5 ,
.Xr jail 8 ,
.Xr mount 8 ,
.Xr rctl 8
.Sh HISTORY
.Nm
was developed to provide native OCI runtime support for FreeBSD.
Phase 1 acceptance covers create/start/state/kill/delete with ATF
unit and root integration tests on FreeBSD lab hosts.
.Sh AUTHORS
.Nm
was developed by
.An "REVYTECH, Inc." ,
including the lifecycle and test work on the
.Li feature/oci-bootstrap
branch.
