cloudbsdorg/freebsd-src-oci/usr.sbin/ocifbsd/export/ocifbsd-export.8
.\"-
.\" Copyright (c) 2026 REVYTECH, Inc.
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" This software was developed by REVYTECH, Inc.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE
.\" USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\"
.Dd June 5, 2026
.Dt OCIFBSD-EXPORT 8
.Os
.Sh NAME
.Nm ocifbsd-export
.Nd ocifbsd cloud export and migration tool
.Sh SYNOPSIS
.Nm
.Ar command
.Op Ar args ...
.Sh DESCRIPTION
The
.Nm
tool exports
.Xr ocifbsd 8
containers and jails to portable formats and re-imports them
on the same or different host.
.Pp
ed formats include:
.Bl -bullet
.It
Flat Export Bundle
.Pq .feb
\(em self-contained single-file archive with metadata,
root filesystem, volumes, and config.
.It
Raw disk image and QCOW2.
.It
Cloud provider images: AWS AMI, GCP image, Azure VHD.
.El
.Pp
The commands are:
.Bl -tag -width indent
.It Cm export Ar name
Export container
.Ar name
to a FEB file in
.Pa /var/lib/ocifbsd/exports/ .
.It Cm import Ar feb_path Ar target_name
Import a FEB file as container
.Ar target_name .
.It Cm list
List all export jobs.
.It Cm status
Show export module statistics.
.El
.Sh FILES
.Bl -tag -width /var/lib/ocifbsd/exports -compact
.It Pa /var/lib/ocifbsd/exports
Default FEB export directory.
.It Pa /var/lib/ocifbsd/containers
Container root filesystems and configs.
.It Pa /var/lib/ocifbsd/volumes
Container volumes.
.It Pa /var/lib/ocifbsd/jails
Jail configurations.
.El
.Sh SEE ALSO
.Xr ocifbsd 8
.Sh HISTORY
The
.Nm
command first appeared in
.Fx 16.0 .
.Sh AUTHORS
The
.Nm
utility was developed by
.An REVYTECH, Inc.
